
## Plan Result (terraform/cloudflare/boxp.tk)

[CI link](https://github.com/boxp/arch/actions/runs/12017487260)


<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.hitohub
* Update
  * cloudflare_record.root
  * cloudflare_record.www


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.hitohub will be created
  + resource "cloudflare_record" "hitohub" {
      + allow_overwrite = false
      + content         = "@"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "hitohub"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "36afdec7e600ae91ce36590fc2320f39"
    }

  # cloudflare_record.root will be updated in-place
  ~ resource "cloudflare_record" "root" {
      + content         = "192.0.2.1"
        id              = "ad3e004b17200df2394e62385c66c1df"
        name            = "@"
        tags            = []
        # (11 unchanged attributes hidden)
    }

  # cloudflare_record.www will be updated in-place
  ~ resource "cloudflare_record" "www" {
      + content         = "@"
        id              = "0aea396992a4b82019c52a2add3b4e13"
        name            = "www"
        tags            = []
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2165,"Program":"tfcmt","SHA1":"8fe17e8c8fb34e44ae28159eb3a434f4c3a4847c","Target":"terraform/cloudflare/boxp.tk","Vars":{},"WorkflowName":"pull_request_target"} -->